Конвертирует теги для OPC сервера из файла экспорта Codesys EXP в формат CSV. Потом его можно скормить Master OPC DA Server.
Теги это переменные внутри интерфейса Modbus Slave ПЛК ,хранящиеся по определенным адресам и имеющие определенный размер.
Данные ,по которым OPC сервер их считывает (Адрес,размер) экспортируются в файл формата EXP средой Codesys.
Входные данные выбираются через GUI.
1. Файл *.exp
2. Номер  Slave интерфейса (Цифра после буквы Q в адресации переменных ,она одинаковая для одного slave интерфейса

Условия:

-Codesys 2.3 c таргетами под ПЛК 100. (Вполне возможно что для другой модели адресация Codesys будет другая , но это не точно)
-Теги (переменные) для отдачи на OPC либо DWORD либо WORD


По итогу мы получаем CSV в том же каталоге. Предполагается что Регион хранения тегов в ПЛК :  HOLDING_REGISTERS
(Для контроллеров ОВЕН вроде так и есть везде)



